**DETERMINATE IF THE NUMBERS OF CHILDREN IS RELATED TO BE IN DEFALUL IN A BANK**

**IMPORTING LIBRARIES**

In [1]:
import pandas as pd

**LOADING DATASET**

In [2]:
df = pd.read_csv('/datasets/credit_scoring_eng.csv')

**SHOWING MAIN FEATURES OF DATASETS**

In [3]:
df.head()

,children,days_employed,dob_years,education,education_id,family_status,family_status_id,gender,income_type,debt,total_income,purpose
0,1,-8437.673028,42,bachelor's degree,0,married,0,F,employee,0,40620.102,purchase of the house
1,1,-4024.803754,36,secondary education,1,married,0,F,employee,0,17932.802,car purchase
2,0,-5623.422610,33,Secondary Education,1,married,0,M,employee,0,23341.752,purchase of the house
3,3,-4124.747207,32,secondary education,1,married,0,M,employee,0,42820.568,supplementary education
4,0,340266.072047,53,secondary education,1,civil partnership,1,F,retiree,0,25378.572,to have a wedding

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21525 entries, 0 to 21524
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   children          21525 non-null  int64
 1   days_employed     19351 non-null  float64
 2   dob_years         21525 non-null  int64
 3   education         21525 non-null  object
 4   education_id      21525 non-null  int64
 5   family_status     21525 non-null  object
 6   family_status_id  21525 non-null  int64
 7   gender            21525 non-null  object
 8   income_type       21525 non-null  object
 9   debt              21525 non-null  int64
 10  total_income      19351 non-null  float64
 11  purpose           21525 non-null  object
dtypes: float64(2), int64(5), object(5)
memory usage: 2.0+ MB

In [5]:
df.isna().sum()

children               0
days_employed       2174
dob_years              0
education              0
education_id           0
family_status          0
family_status_id       0
gender                 0
income_type            0
debt                   0
total_income        2174
purpose                0
dtype: int64

**DATA PRE-PROCESSING:**

**NaN values**

**Note:** days_employed is not necessary for the analysis, hence we will delete the columnn

In [6]:
df.drop(columns='days_employed', errors='ignore', inplace=True)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21525 entries, 0 to 21524
Data columns (total 11 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   children          21525 non-null  int64
 1   dob_years         21525 non-null  int64
 2   education         21525 non-null  object
 3   education_id      21525 non-null  int64
 4   family_status     21525 non-null  object
 5   family_status_id  21525 non-null  int64
 6   gender            21525 non-null  object
 7   income_type       21525 non-null  object
 8   debt              21525 non-null  int64
 9   total_income      19351 non-null  float64
 10  purpose           21525 non-null  object
dtypes: float64(1), int64(5), object(5)
memory usage: 1.8+ MB

***- NaN values in total_income column***

In [7]:
income_max = df['total_income'].max()
income_max

362496.645

In [8]:
income_min = df['total_income'].min()
income_min

3306.762

**Conclusi√≥n:** Because there is a big difference between max and min values, we will use the median as a representative value for substituting the NaN values.

In [9]:
income_median = df['total_income'].median()
income_median

23202.87

In [10]:
df['total_income'] = df['total_income'].fillna(income_median)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21525 entries, 0 to 21524
Data columns (total 11 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   children          21525 non-null  int64
 1   dob_years         21525 non-null  int64
 2   education         21525 non-null  object
 3   education_id      21525 non-null  int64
 4   family_status     21525 non-null  object
 5   family_status_id  21525 non-null  int64
 6   gender            21525 non-null  object
 7   income_type       21525 non-null  object
 8   debt              21525 non-null  int64
 9   total_income      21525 non-null  float64
 10  purpose           21525 non-null  object
dtypes: float64(1), int64(5), object(5)
memory usage: 1.8+ MB

**Conclusion:** No more NaN values in dataset

**Changing data type in total_income column (float to integer)**

In [11]:
df['total_income'] = pd.to_numeric(df['total_income'], errors='raise').astype('int')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21525 entries, 0 to 21524
Data columns (total 11 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   children          21525 non-null  int64
 1   dob_years         21525 non-null  int64
 2   education         21525 non-null  object
 3   education_id      21525 non-null  int64
 4   family_status     21525 non-null  object
 5   family_status_id  21525 non-null  int64
 6   gender            21525 non-null  object
 7   income_type       21525 non-null  object
 8   debt              21525 non-null  int64
 9   total_income      21525 non-null  int64
 10  purpose           21525 non-null  object
dtypes: int64(6), object(5)
memory usage: 1.8+ MB

**Implicit duplicates**

***- Education column***

In [12]:
d1 = df['education'].value_counts().sort_values(ascending=False)
d1

secondary education    13750
bachelor's degree       4718
SECONDARY EDUCATION      772
Secondary Education      711
some college             668
BACHELOR'S DEGREE        274
Bachelor's Degree        268
primary education        250
Some College              47
SOME COLLEGE              29
PRIMARY EDUCATION         17
Primary Education         15
graduate degree            4
GRADUATE DEGREE            1
Graduate Degree            1
Name: education, dtype: int64

In [13]:
df['education'] = df['education'].str.lower()

In [14]:
d1 = df['education'].value_counts().sort_values(ascending=False)
d1

secondary education    15233
bachelor's degree       5260
some college             744
primary education        282
graduate degree            6
Name: education, dtype: int64

***- Family_status column***

In [15]:
d2 = df['family_status'].value_counts().sort_values(ascending=False)
d2

married              12380
civil partnership     4177
unmarried             2813
divorced              1195
widow / widower        960
Name: family_status, dtype: int64

In [16]:
df.loc[df['family_status'] == 'widow / widower', 'family_status'] = 'widowed'

In [17]:
d2 = df['family_status'].value_counts().sort_values(ascending=False)
d2

married              12380
civil partnership     4177
unmarried             2813
divorced              1195
widowed                960
Name: family_status, dtype: int64

***- Gender column***

In [18]:
d3 = df['gender'].value_counts().sort_values(ascending=False)
d3

F      14236
M       7288
XNA        1
Name: gender, dtype: int64

In [19]:
df.loc[df['gender'] == 'XNA', 'gender'] = 'NA'

In [20]:
d3 = df['gender'].value_counts().sort_values(ascending=False)
d3

F     14236
M      7288
NA        1
Name: gender, dtype: int64

***- Income_type column***

In [21]:
d4 = df['income_type'].value_counts().sort_values(ascending=False)
d4

employee                       11119
business                        5085
retiree                         3856
civil servant                   1459
unemployed                         2
entrepreneur                       2
student                            1
paternity / maternity leave        1
Name: income_type, dtype: int64

**- Purpose column**

In [22]:
d5 = df['purpose'].value_counts().sort_values(ascending=False)
d5

wedding ceremony                            797
having a wedding                            777
to have a wedding                           774
real estate transactions                    676
buy commercial real estate                  664
housing transactions                        653
buying property for renting out             653
transactions with commercial real estate    651
housing                                     647
purchase of the house                       647
purchase of the house for my family         641
construction of own property                635
property                                    634
transactions with my real estate            630
building a real estate                      626
buy real estate                             624
building a property                         620
purchase of my own house                    620
housing renovation                          612
buy residential real estate                 607
buying my own car                           505
going to university                         496
car                                         495
second-hand car purchase                    489
to own a car                                480
buying a second-hand car                    479
cars                                        478
to buy a car                                472
supplementary education                     462
car purchase                                462
purchase of a car                           455
university education                        453
education                                   447
to get a supplementary education            447
getting an education                        443
profile education                           436
getting higher education                    426
to become educated                          412
Name: purpose, dtype: int64

**categorize**

The following columns will be categorized:

- purpose
- total_income
- debt
- children

***- Categorizing purpose column***

In [23]:
def purpose_categ(purpose):
    if 'property' in purpose:
        return 'real estate'
    if 'real estate' in purpose:
        return 'real estate'
    if 'hous' in purpose:
        return 'real estate'
    if 'car' in purpose:
        return 'buy a car'
    if 'educat' in purpose:
        return 'education'
    if 'university' in purpose:
        return 'education'
    if 'wedding' in purpose:
        return 'wedding'

In [24]:
df['purpose'] = df['purpose'].apply(purpose_categ)

In [25]:
d6 = df['purpose'].value_counts(dropna=False).sort_index(axis=0, ascending=True)
d6

buy a car       4315
education       4022
real estate    10840
wedding         2348
Name: purpose, dtype: int64

***- Categorizing children column***

In [26]:
d7 = df['children'].value_counts().sort_values(ascending=False)
d7

 0     14149
 1      4818
 2      2055
 3       330
 20       76
-1        47
 4        41
 5         9
Name: children, dtype: int64

**Conclusion:**

- Negatives values will be considered a typo, they are a positive quantity.
- 20 children is not a logical value, it will be considered a typo too, and changed to 2

In [27]:
df['children'] = df['children'].abs()

In [28]:
df.loc[df['children'] == 20, 'children'] = 2

In [29]:
d8 = df['children'].value_counts().sort_values(ascending=False)
d8

0    14149
1     4865
2     2131
3      330
4       41
5        9
Name: children, dtype: int64

In [30]:
def children_categ(num_children):
    if num_children == 0:
        return 'no children'
    if num_children > 0:
        return 'children'

In [31]:
df['children_categ'] = df['children'].apply(children_categ)

In [32]:
d9 = df['children_categ'].value_counts().sort_values(ascending=False)
d9

no children    14149
children        7376
Name: children_categ, dtype: int64

In [33]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 21525 entries, 0 to 21524
Data columns (total 12 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   children          21525 non-null  int64
 1   dob_years         21525 non-null  int64
 2   education         21525 non-null  object
 3   education_id      21525 non-null  int64
 4   family_status     21525 non-null  object
 5   family_status_id  21525 non-null  int64
 6   gender            21525 non-null  object
 7   income_type       21525 non-null  object
 8   debt              21525 non-null  int64
 9   total_income      21525 non-null  int64
 10  purpose           21525 non-null  object
 11  children_categ    21525 non-null  object
dtypes: int64(6), object(6)
memory usage: 2.0+ MB

***- Categorizing debt column***

In [34]:
d10 = df['debt'].value_counts().sort_values(ascending=False)
d10

0    19784
1     1741
Name: debt, dtype: int64

In [35]:
def debt_categ(debt):
    if debt == 0:
        return 'on time'
    if debt == 1:
        return 'default'

In [36]:
df['debt_categ'] = df['debt'].apply(debt_categ)

In [37]:
d10 = df['debt_categ'].value_counts().sort_values(ascending=False)
d10

on time    19784
default     1741
Name: debt_categ, dtype: int64

In [38]:
debt_status_dict = df[['debt', 'debt_categ']]
debt_status_dict = debt_status_dict.drop_duplicates().reset_index(drop=True).sort_values(by='debt', ascending=True)
debt_status_dict

   debt debt_categ
0     0    on time
1     1    default

***- Categorizing total_income column***

In [39]:
def total_income_categ(income):
    if income >= df['total_income'].median():
        return 'above median'
    if income < df['total_income'].median():
        return 'below median'

In [40]:
df['total_income_categ'] = df['total_income'].apply(total_income_categ)

In [41]:
d11 = df['total_income_categ'].value_counts().sort_values(ascending=False)
d11

above median    11850
below median     9675
Name: total_income_categ, dtype: int64

***- Categorizing family_status column***

In [42]:
marital_status_dict = df[['family_status', 'family_status_id']]
marital_status_dict = marital_status_dict.drop_duplicates().reset_index(drop=True).sort_values(by='family_status_id', ascending=False)
marital_status_dict

       family_status  family_status_id
4          unmarried                 4
3           divorced                 3
2            widowed                 2
1  civil partnership                 1
0            married                 0

In [43]:
d12 = df['family_status'].value_counts().sort_values(ascending=False)
d12

married              12380
civil partnership     4177
unmarried             2813
divorced              1195
widowed                960
Name: family_status, dtype: int64

**RELATIONSHIP BETWEEN HAVING CHILDREN AND BEING IN DEFAULT**

In [44]:
children_data = pd.DataFrame(df.groupby('children_categ')['debt_categ'].value_counts())
children_data

                           debt_categ
children_categ debt_categ
children       on time           6698
               default            678
no children    on time          13086
               default           1063

In [45]:
defaul_fraction_children = children_data.loc['children', 'default']['debt_categ'] / children_data.loc['children'].sum()*100
defaul_fraction_children

debt_categ    9.191974
dtype: float64

In [46]:
defaul_fraction_no_children = children_data.loc['no children', 'default']['debt_categ'] / children_data.loc['no children'].sum()*100
defaul_fraction_no_children

debt_categ    7.512898
dtype: float64

**Conclusion:** Clients with children are more likely to be in default

**RELATIONSHIP BETWEEN CIVIL STATUS AND BEING IN DEFAULT**

In [47]:
civil_status_data = pd.DataFrame(df.groupby('family_status')['debt_categ'].value_counts())
civil_status_data

                              debt_categ
family_status     debt_categ
civil partnership on time           3789
                  default            388
divorced          on time           1110
                  default             85
married           on time          11449
                  default            931
unmarried         on time           2539
                  default            274
widowed           on time            897
                  default             63

In [48]:
defaul_fraction_civil_partnership = civil_status_data.loc['civil partnership', 'default']['debt_categ'] / civil_status_data.loc['civil partnership'].sum() * 100
defaul_fraction_civil_partnership

debt_categ    9.288963
dtype: float64

In [49]:
defaul_fraction_divorced = civil_status_data.loc['divorced', 'default']['debt_categ'] / civil_status_data.loc['divorced'].sum() * 100
defaul_fraction_divorced

debt_categ    7.112971
dtype: float64

In [50]:
defaul_fraction_married = civil_status_data.loc['married', 'default']['debt_categ'] / civil_status_data.loc['married'].sum() * 100
defaul_fraction_married

debt_categ    7.520194
dtype: float64

In [51]:
defaul_fraction_unmarried = civil_status_data.loc['unmarried', 'default']['debt_categ'] / civil_status_data.loc['unmarried'].sum() * 100
defaul_fraction_unmarried

debt_categ    9.740491
dtype: float64

In [52]:
defaul_fraction_widowed = civil_status_data.loc['widowed', 'default']['debt_categ'] / civil_status_data.loc['widowed'].sum() * 100
defaul_fraction_widowed

debt_categ    6.5625
dtype: float64

**GENERAL CONCLUSION:**

- Dataset was pretty good regarding the NaN values, as two columns only had them (NaN values).
- Days employed column was deleted because it did not supply any relevance to analysis.
- For total_income columns, the median was used to substitue NaN values because there was a big difference between max and min values.
- Data type were almost correct in all dataset except for total_income column. Float data type was change to integer.
- There were several columns with implicit duplicates, the most of them were related to typo.
- Education column went from 15 types of entries to 5 types of entries (67% less).
- Purpose, total_income, debt and children columns were categorized to simplify the analysis.
- Purpose column with 38 types of entry was categorized (grouped) by 7 categories, getting easy the analysis.
- Children column was categorized with 2 categories: children and no-children.
- Debt column was categorized eith text entry (string): on time and default category.
- For total_income category, the median of this variable was calculated and categorized as above and below the median.
- Clients with children are more likely to be in default tha clients with no children.
- Regarding the marital status, clients in civil partnership are more likely to be in default.
- The more unlikely clients to be in defaul are those who are widowed.